In [1]:
import numpy as np
import pandas as pd

In [4]:
# series 사용 / index와 값이 함께 나옴
obj = pd.Series([4,7, -5, 3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
# series의 값만
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
obj.dtypes

dtype('int64')

In [9]:
# Series는 원하는 index를 대신 대입 가능
obj2 = pd.Series([4,7,-5,3], index=['d','b','a','c'])

In [10]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [13]:
# Series는 dictionary 형태로도 가능
sdata = {"Charles":35000, "Kilho":7100, "Hayoung":16000, "Sangjae": 5000}
obj3 = pd.Series(sdata)

In [14]:
obj3

Charles    35000
Kilho       7100
Hayoung    16000
Sangjae     5000
dtype: int64

In [17]:
# Series 자체 이름 붙혀주기
obj3.name = "Salary"
# index에 해당하는 부분 자체 이름 붙혀주기
obj3.index.name= "Names"
obj3

Names
Charles    35000
Kilho       7100
Hayoung    16000
Sangjae     5000
Name: Salary, dtype: int64

In [18]:
# 기존 index 변경
obj3.index=['A','B','C','D']

In [19]:
obj3

A    35000
B     7100
C    16000
D     5000
Name: Salary, dtype: int64

In [22]:
# dataframe / dataframe 입력 / python dictionary 형태로 입력
data = {"names": ["Kilho", "Kilho", "Kilho", "Charles", "Chearles"],
       "year": [2014, 2015, 2016, 2015, 2016],
       "points": [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data)

In [24]:
df
# 엑셀에서 사용하는 table 모양과 아주 흡사

      names  year  points
0     Kilho  2014     1.5
1     Kilho  2015     1.7
2     Kilho  2016     3.6
3   Charles  2015     2.4
4  Chearles  2016     2.9

In [29]:
# 행방향 index를 행 / 열방향 index를 columns
df.index

RangeIndex(start=0, stop=5, step=1)

In [28]:
df.columns

Index(['names', 'year', 'points'], dtype='object')

In [32]:
# values는 array형태로 불러와진다
df.values

array([['Kilho', 2014, 1.5],
       ['Kilho', 2015, 1.7],
       ['Kilho', 2016, 3.6],
       ['Charles', 2015, 2.4],
       ['Chearles', 2016, 2.9]], dtype=object)

In [33]:
df.index.name="Num"
df.columns.name="Info"
df

Info     names  year  points
Num
0        Kilho  2014     1.5
1        Kilho  2015     1.7
2        Kilho  2016     3.6
3      Charles  2015     2.4
4     Chearles  2016     2.9

In [34]:
# tip df. + tab  => 사용할 수 있는 함수 나옴

In [38]:
df2 = pd.DataFrame(data, columns = ["year", "names", "points", "penalty"],
                  index = ["one", "two", "three", "four", "five"])

In [41]:
df2 # NaN은 not a number로 특정 값 포함 안되어있을 때 nan으로 표기 / 다른 값으로 매꾸어야함

       year     names  points penalty
one    2014     Kilho     1.5     NaN
two    2015     Kilho     1.7     NaN
three  2016     Kilho     3.6     NaN
four   2015   Charles     2.4     NaN
five   2016  Chearles     2.9     NaN

In [42]:
df2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [43]:
df2.columns

Index(['year', 'names', 'points', 'penalty'], dtype='object')

In [44]:
df2.values

array([[2014, 'Kilho', 1.5, nan],
       [2015, 'Kilho', 1.7, nan],
       [2016, 'Kilho', 3.6, nan],
       [2015, 'Charles', 2.4, nan],
       [2016, 'Chearles', 2.9, nan]], dtype=object)

In [47]:
# describe 계산이 가능한 columns 들을 자동으로 계산해 보여줌
df2.describe()

             year    points
count     5.00000  5.000000
mean   2015.20000  2.420000
std       0.83666  0.864292
min    2014.00000  1.500000
25%    2015.00000  1.700000
50%    2015.00000  2.400000
75%    2016.00000  2.900000
max    2016.00000  3.600000